ERP.belugaerp/src/InformationRegisters/бг_ФиксацияПечатиДокументов/бг_ФиксацияПечатиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ФиксацияПечатиДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКорректировки</name>
    <type>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспечатанныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураВыданный</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.бг_ФиксируемыеПечатныеФормы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/бг_ТранспортнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ТранспортнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаПеревозку</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорСубподряда</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьЧерез</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <comment>Номер Заказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомераПломб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеДополнительныхСведений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСведенийТНиСВ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ПорядковыйНомерТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВладенияТС</name>
    <type>
      <types>CatalogRef.бг_ТипыВладенияТС</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизаторПеревозки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладение</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладениеПрицеп</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МыГрузимТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиС</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиПо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяКорректировкаДатыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ФиксацияПечатиДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Процедура - Фиксирует печать документов 
//
// Параметры:
//  ТабличныеДокументы - СписокЗначений 
//  ОбъектыПечати - СписокЗначений - Список документов 
//  СписокПечати - СписокЗначений - Идентификаторы макетов
//	АдресПовторноФиксируемыхДокументов - Неопределено - Адрес, по которому поместятся 
//		вторично фиксируемые документы
//
Процедура ЗафиксироватьПечатьДокументов(ТабличныеДокументы, ОбъектыПечати, 
	СписокПечати, АдресПовторноФиксируемыхДокументов) Экспорт

	РаспечатанныеДокументы = РаспечатанныеДокументы(ТабличныеДокументы, ОбъектыПечати, СписокПечати);
	
	ОтражаемыеДокументы = Справочники.бг_НастройкиФиксацииПечатныхФорм.ДокументыПоНастройкамФиксации(
		РаспечатанныеДокументы, АдресПовторноФиксируемыхДокументов);

	Если ОтражаемыеДокументы.Количество() <> 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеДляЗаписи = ДанныеДокументовДляЗаписи(ОтражаемыеДокументы);
		ОтразитьФактПечатиДокументов(ДанныеДляЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Фиксирует печать комплекта документов
//
// Параметры:
//  КоллекцияПечатныхФормПоОбъектам - ТаблицаЗначений
//	АдресПовторноФиксируемыхДокументов - Неопределено - Адрес, по которому поместятся 
//		вторично фиксируемые документы
//
Процедура ЗафиксироватьПечатьКомплектаДокументов(КоллекцияПечатныхФормПоОбъектам, 
	АдресПовторноФиксируемыхДокументов) Экспорт

	РаспечатанныеДокументы = ИнициализироватьТаблицуРаспечатанныхДокументов();
	
	Для Каждого КоллекцияПоОбъекту Из КоллекцияПечатныхФормПоОбъектам Цикл
		
		ОбъектПечати = КоллекцияПоОбъекту.Ключ;
		ПечатныеФормыПоОбъекту = КоллекцияПоОбъекту.Значение;
		
		КолонкаСодержитТип = РаспечатанныеДокументы.Колонки.ОбъектПечати.ТипЗначения.СодержитТип(
				ТипЗнч(ОбъектПечати));
				
		Если Не КолонкаСодержитТип Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПечатнаяФорма Из ПечатныеФормыПоОбъекту Цикл
			
			Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			ДанныеРаспечатанногоДокумента = РаспечатанныеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(ДанныеРаспечатанногоДокумента, ПечатнаяФорма);
			
			ДанныеРаспечатанногоДокумента.ОбъектПечати = ОбъектПечати;
			ДанныеРаспечатанногоДокумента.КоличествоСтраниц = ПечатнаяФорма.ТабличныйДокумент.КоличествоСтраниц();
			
		КонецЦикла;	
			
	КонецЦикла;
	
	ОтражаемыеДокументы = Справочники.бг_НастройкиФиксацииПечатныхФорм.ДокументыПоНастройкамФиксации(
		РаспечатанныеДокументы, АдресПовторноФиксируемыхДокументов);
		
	Если ОтражаемыеДокументы.Количество() <> 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеДляЗаписи = ДанныеДокументовДляЗаписи(ОтражаемыеДокументы);
		ОтразитьФактПечатиДокументов(ДанныеДляЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РаспечатанныеДокументы(ТабличныеДокументы, ОбъектыПечати, СписокПечати)
	
	РаспечатанныеДокументы = ИнициализироватьТаблицуРаспечатанныхДокументов();
	
	Если ОбъектыПечати.Количество() = 0 Тогда
		Возврат РаспечатанныеДокументы;
	КонецЕсли;
	
	Для Каждого ТабличныйДокумент Из ТабличныеДокументы Цикл
		
		ИдентификаторМакета = ИдентификаторМакетаТабличногоДокумента(
			СписокПечати, 
			ТабличныйДокумент.Представление);
		
		Если ИдентификаторМакета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокументИсходный = ТабличныйДокумент.Значение;
		
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			
			КолонкаСодержитТип = РаспечатанныеДокументы.Колонки.ОбъектПечати.ТипЗначения.СодержитТип(
				ТипЗнч(ОбъектПечати.Значение));
			
			Если Не КолонкаСодержитТип Тогда
				Продолжить;	
			КонецЕсли;	
			
			КоличествоСтраниц = КоличествоСтраницРаспечатанногоОбъекта(
				ТабличныйДокументИсходный, 
				ОбъектПечати);
				
			Если КоличествоСтраниц = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеРаспечатанногоДокумента = РаспечатанныеДокументы.Добавить();
			
			ДанныеРаспечатанногоДокумента.ОбъектПечати = ОбъектПечати.Значение;
			ДанныеРаспечатанногоДокумента.ИдентификаторМакета = ИдентификаторМакета;	
			ДанныеРаспечатанногоДокумента.КоличествоСтраниц = КоличествоСтраниц;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	РаспечатанныеДокументы.Свернуть("ОбъектПечати,ИдентификаторМакета", "КоличествоСтраниц");
	
	Возврат РаспечатанныеДокументы;
		
КонецФункции

Функция ИнициализироватьТаблицуРаспечатанныхДокументов() 
	
	РаспечатанныеДокументы = Новый ТаблицаЗначений;
	
	РаспечатанныеДокументы.Колонки.Добавить("ОбъектПечати", ОписаниеТиповОбъектаПечати());
	РаспечатанныеДокументы.Колонки.Добавить("ИдентификаторМакета", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	РаспечатанныеДокументы.Колонки.Добавить("КоличествоСтраниц", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	
	Возврат РаспечатанныеДокументы;
	
КонецФункции	

Функция ИдентификаторМакетаТабличногоДокумента(СписокПечати, ПредставлениеТабличногоДокумента)
	
	ИдентификаторМакета = Неопределено;
	
	Для Каждого РаспечатанныеМакеты Из СписокПечати Цикл
		
		Если СтрНайти(ПредставлениеТабличногоДокумента, РаспечатанныеМакеты.Представление) Тогда
			ИдентификаторМакета = РаспечатанныеМакеты.Значение;
			
			ПозицияСимволаРазделенияСтраниц = СтрНайти(ИдентификаторМакета, "/");
			
			Если ПозицияСимволаРазделенияСтраниц <> 0 Тогда
				ИдентификаторМакета = Лев(ИдентификаторМакета, ПозицияСимволаРазделенияСтраниц - 1);	
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	

	Возврат ИдентификаторМакета;
	
КонецФункции	

Функция КоличествоСтраницРаспечатанногоОбъекта(ТабличныйДокументИсходный, ОбъектПечати)
	
	КоличествоСтраниц = 0;
	
	ЕстьОбластьПечатиОбъекта = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
		ТабличныйДокументИсходный.Области, 
		ОбъектПечати.Представление);
	
	Если ЕстьОбластьПечатиОбъекта Тогда
		
		ОбластьПечатиОбъекта = ТабличныйДокументИсходный.Области[ОбъектПечати.Представление];
		
		НомерСтрокиОкончание = ОбластьПечатиОбъекта.Низ - ОбластьПечатиОбъекта.Верх + 1;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ТабличныйДокумент.Область(1, , НомерСтрокиОкончание).Имя = ОбъектПечати.Представление;
		
		ЗаполнитьЗначенияСвойств(
			ТабличныйДокумент, 
			ТабличныйДокументИсходный, 
			УправлениеПечатью.КопируемыеСвойстваТабличногоДокумента());
		
		ТабличныйДокумент.ВставитьОбласть(
			ОбластьПечатиОбъекта, 
			ТабличныйДокумент.Области[ОбъектПечати.Представление],, 
			Истина);
		
		КоличествоСтраниц = ТабличныйДокумент.КоличествоСтраниц();	
		
	КонецЕсли;
		
	Возврат КоличествоСтраниц;	
	
КонецФункции	

Функция ДанныеДокументовДляЗаписи(ОтражаемыеДокументы) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтражаемыеДокументы.Документ КАК Документ,
	|	ОтражаемыеДокументы.ОбъектПечати КАК ОбъектПечати,
	|	ОтражаемыеДокументы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	ОтражаемыеДокументы.КоличествоСтраниц КАК КоличествоСтраниц,
	|	ОтражаемыеДокументы.РаспечатанныйНомер КАК РаспечатанныйНомер,
	|	ОтражаемыеДокументы.ПечатнаяФорма КАК ПечатнаяФорма,
	|	ОтражаемыеДокументы.ДокументКорректировки КАК ДокументКорректировки,
	|	ОтражаемыеДокументы.СчетФактураВыданный КАК СчетФактураВыданный
	|ПОМЕСТИТЬ ОтражаемыеДокументы
	|ИЗ
	|	&ОтражаемыеДокументы КАК ОтражаемыеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражаемыеДокументы.Документ КАК Документ,
	|	ОтражаемыеДокументы.ОбъектПечати КАК ОбъектПечати,
	|	ОтражаемыеДокументы.ПечатнаяФорма КАК ПечатнаяФорма,
	|	ОтражаемыеДокументы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	ОтражаемыеДокументы.КоличествоСтраниц КАК КоличествоСтраниц,
	|	ОтражаемыеДокументы.РаспечатанныйНомер КАК РаспечатанныйНомер,
	|	ОтражаемыеДокументы.ДокументКорректировки КАК ДокументКорректировки,
	|	ОтражаемыеДокументы.СчетФактураВыданный КАК СчетФактураВыданный,
	|	РегТранспортнаяИнформация.Водитель КАК Водитель,
	|	РегТранспортнаяИнформация.Перевозчик КАК Перевозчик,
	|	РегТранспортнаяИнформация.ТранспортноеСредство КАК Транспорт
	|ИЗ
	|	ОтражаемыеДокументы КАК ОтражаемыеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫРАЗИТЬ(ТранспортнаяИнформация.Объект КАК Документ.РеализацияТоваровУслуг) КАК Объект,
	|			МАКСИМУМ(ТранспортнаяИнформация.ТранспортноеСредство) КАК ТранспортноеСредство
	|		ИЗ
	|			РегистрСведений.бг_ТранспортнаяИнформация КАК ТранспортнаяИнформация
	|		ГДЕ
	|			ВЫРАЗИТЬ(ТранспортнаяИнформация.Объект КАК Документ.РеализацияТоваровУслуг) В
	|					(ВЫБРАТЬ
	|						ОтражаемыеДокументы.Документ
	|					ИЗ
	|						ОтражаемыеДокументы)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫРАЗИТЬ(ТранспортнаяИнформация.Объект КАК Документ.РеализацияТоваровУслуг)) КАК ТранспортнаяИнформация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_ТранспортнаяИнформация КАК РегТранспортнаяИнформация
	|			ПО ТранспортнаяИнформация.Объект = РегТранспортнаяИнформация.Объект
	|				И ТранспортнаяИнформация.ТранспортноеСредство = РегТранспортнаяИнформация.ТранспортноеСредство
	|		ПО ОтражаемыеДокументы.Документ = ТранспортнаяИнформация.Объект";
	
	Запрос.УстановитьПараметр("ОтражаемыеДокументы", ОтражаемыеДокументы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОтразитьФактПечатиДокументов(ДанныеДляЗаписи) Экспорт

	ДатаПечати = ТекущаяДатаСеанса();
		
	Для Каждого Запись Из ДанныеДляЗаписи Цикл
		
		МенеджерЗаписи = РегистрыСведений.бг_ФиксацияПечатиДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
		МенеджерЗаписи.Период = ДатаПечати;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция ОписаниеТиповОбъектаПечати()

	ТипыОбъектовПечати = Новый Массив;
	ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.СчетФактураВыданный"));
	ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.КорректировкаПриобретения"));
	
	Возврат Новый ОписаниеТипов(ТипыОбъектовПечати);
	
КонецФункции

#КонецОбласти

#КонецЕсли
